; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob76) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate0)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate4)
	(at pallet8 depot1)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear crate2)
	(at pallet10 distributor0)
	(clear pallet10)
	(at pallet11 distributor0)
	(clear pallet11)
	(at truck0 distributor2)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 depot2)
	(available hoist10)
	(at hoist11 depot2)
	(available hoist11)
	(at hoist12 distributor1)
	(available hoist12)
	(at hoist13 distributor1)
	(available hoist13)
	(at hoist14 distributor0)
	(available hoist14)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor1)
	(on crate2 pallet9)
	(at crate3 distributor2)
	(on crate3 pallet7)
	(at crate4 distributor2)
	(on crate4 crate3)
)

(:goal (and
		(on crate0 pallet4)
		(on crate1 pallet10)
		(on crate3 pallet5)
		(on crate4 pallet9)
	)
))

; plan
1. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 0 of 4
2. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 0 of 4
3. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 4
4. (unload hoist8 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 0 of 4
5. (drop hoist8 crate1 pallet10 distributor0)
   deleted: (lifting hoist8 crate1) (clear pallet10)
   added: (available hoist8) (at crate1 distributor0) (clear crate1) (on crate1 pallet10)
   goals met: 1 of 4
6. (lift hoist6 crate4 crate3 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist6) (on crate4 crate3)
   added: (lifting hoist6 crate4) (clear crate3)
   goals met: 1 of 4
7. (load hoist6 crate4 truck0 distributor2)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck0) (available hoist6)
   goals met: 1 of 4
8. (lift hoist9 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist9) (on crate0 pallet5)
   added: (lifting hoist9 crate0) (clear pallet5)
   goals met: 1 of 4
9. (load hoist9 crate0 truck0 distributor2)
   deleted: (lifting hoist9 crate0)
   added: (in crate0 truck0) (available hoist9)
   goals met: 1 of 4
10. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 1 of 4
11. (unload hoist4 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist4)
   added: (lifting hoist4 crate0)
   goals met: 1 of 4
12. (unload hoist13 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist13)
   added: (lifting hoist13 crate4)
   goals met: 1 of 4
13. (drop hoist4 crate0 pallet4 distributor1)
   deleted: (lifting hoist4 crate0) (clear pallet4)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 pallet4)
   goals met: 2 of 4
14. (lift hoist9 crate3 pallet7 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist9) (on crate3 pallet7)
   added: (lifting hoist9 crate3) (clear pallet7)
   goals met: 2 of 4
15. (drop hoist9 crate3 pallet5 distributor2)
   deleted: (lifting hoist9 crate3) (clear pallet5)
   added: (available hoist9) (at crate3 distributor2) (clear crate3) (on crate3 pallet5)
   goals met: 3 of 4
16. (lift hoist12 crate2 pallet9 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist12) (on crate2 pallet9)
   added: (lifting hoist12 crate2) (clear pallet9)
   goals met: 3 of 4
17. (drop hoist13 crate4 pallet9 distributor1)
   deleted: (lifting hoist13 crate4) (clear pallet9)
   added: (available hoist13) (at crate4 distributor1) (clear crate4) (on crate4 pallet9)
   goals met: 4 of 4
